//* Функції *//

// Напиши функцію, яка приймає два параметри(a і b) та повертає їхню суму.

//!==========================================================================================

// Напиши функцію, яка приймає три параметри (a, b, c) і повертає максимальне з них.

//!==========================================================================================

// Напиши функцію, яка приймає три параметри (число, мінімум і максимум) та повертає true, 
// якщо число знаходиться між мінімумом і максимумом (включно), і false, якщо ні.

//!==========================================================================================

// Напиши функцію, яка приймає рядок і повертає перший символ цього рядка.

//!==========================================================================================

// Напиши функцію, яка приймає рядок і повертає останній символ цього рядка.

//!==========================================================================================

// Напиши функцію, яка приймає число і повертає true, якщо число парне, і false, якщо ні.

//!==========================================================================================

// Напиши функцію яка приймає два числа. Якщо одне з чисел дорівнює нуль то повернути null, 
// в іншому випадку повернути добуток цих двох чисел.

//!==========================================================================================

// Напиши функцію яка приймає рядок і повертає цей самий рядок але огорнутий у тег div.
// Приклад: на вході був рядок "Hello world" а на виході рядок "<div>Hello world<div>"

//!==========================================================================================

// Напиши функцію, яка приймає рядок і повертає кількість слів у ньому (слова розділені пробілами).

//!==========================================================================================

// Напиши функцію, яка приймає рядок і повертає його довжину помножену на кількість слів в цьому рядку.

//!==========================================================================================

// Напиши функцію, яка приймає рядок і повертає кількість голосних літер у ньому (a, e, i, o, u). 
// Використовуйте метод includes та цикл.

//!==========================================================================================

// Напиши функцію, яка приймає рядок і повертає новий рядок, де слова розташовані у зворотному порядку.

//!==========================================================================================

// Напиши функцію, яка приймає довільну кількість аргументів і повертає true, 
// якщо всі аргументи є числами, і false, якщо ні.

//!==========================================================================================

// Напиши функцію, яка приймає довільну кількість аргументів і повертає їх 
// об'єднаними в один рядок, розділений комами.

//!==========================================================================================

// Напиши функцію, яка приймає довільну кількість чисел і повертає їхній добуток.

//!==========================================================================================

// Напиши функцію, яка приймає довільну кількість чисел і повертає кількість непарних чисел серед них.

//!==========================================================================================

// Напиши функцію яка приймає довільну кількість рядочків і повертає той рядок що є найдовшим

//!==========================================================================================

// Напиши функцію яка приймає довільну кількість рядочків і обєднує їх в один цілий рядок.

//!==========================================================================================

// Напиши функцію яка приймає два числа. Якщо одне з чисел дорівнює нуль то повернути null,
//  в іншому випадку повернути добуток цих двох чисел.