//* Масиви та методи рядкочків

// Напиши цикл, який виведе на консоль числа від 1 до 10.

//     for (let i = 1; i <= 10; i++) {
//         console.log(i);
// };


//!==========================================================================================

// Напиши цикл, який виведе на консоль парні числа від 1 до 20.

// for (let i = 1; i <= 20; i++){
//     if (i % 2 === 0) {
// console.log(i);
//     };
// }

//!==========================================================================================

// Напиши цикл, який знайде та виведе на консоль суму всіх чисел від 1 до 100.
// let sum = 0;
// for (let i = 1; i <= 100; i++){
//     sum +=i
// }
// console.log(sum);

//!==========================================================================================

// Напиши цикл, який виведе на консоль таблицю множення для числа 7 (від 1 до 10).

// for (let i = 1; i <= 10; i++){
//     console.log(`7 * ${i} = ${7*i}`)
// }

//!==========================================================================================

// Напиши цикл, який обчислить факторіал числа, введеного користувачем 
// (наприклад, факторіал числа 5: !5 = 1 * 2 * 3 * 4 * 5).



//!==========================================================================================

// Напиши цикл, який виведе кожну другу літеру рядочку "Hello world"
// let str = 'HelloWorld'
// for (let i = 1; i < str.length-1; i +=2){
//     console.log(str[i]);
// }

//!==========================================================================================

// Напиши цикл, який виведе кожну літеру рядочку "Hello world" у зворотньому порядку.
// const str = 'Hello world';
// const newStr = str.split('').reverse().join('');
// console.log(newStr);

// for (let i = 0; i < str.length; i++){
//     console.log(newStr[i]); 
// }

// for (let i = str.length - 1; i >= 0, i--){
//     console.log(str[i]);  
// }

//!==========================================================================================

// Напиши цикл, який виведе кожну літеру рядочку "Hello world" поки не зустріне пробіл.

// const str2 = 'Hello world';
// for (let value of str2){
//     if (value === ' ') {
//         break;
//     }
//     console.log(value)
// }

//!==========================================================================================

// Напиши цикл, який виведе на консоль кожну другу літеру слова "JavaScript".

// const str3 ='JavaScript';
// for (let i = 0; i < str3.length; i++){
//     if (i % 2 !== 0) {
//         console.log(str3[i]);
//     }
// };

// const text = "JavaScript";
// for (let i = 1; i < text.length; i += 2) {
//     console.log(text[i]);
// };


//!==========================================================================================

// Напиши функцію, яка приймає рядок та повертає перевернутий рядок.

// function isReverse(string) {
//     const str5 = string;
//     for (let i = str5.length - 1; i >= 0; i--){
//         console.log(str5[i]);
//     };
// };

// isReverse('JavaScript')

//!==========================================================================================

// Напиши функцію, яка приймає рядок та повертає рядок де кожен другий символ у верхньому регістрі

// function isUpperCase(string) {

//     let result = '';

//     for (let i = 0; i < string.length; i++){
//         if (i % 2 !== 0) {
//             result += string[i].toUpperCase();
//         } else {
//             result += string[i]
//         }
//     }
//     return result;
// };


// console.log(isUpperCase('JavaScript'));

//!==========================================================================================

// Напиши функцію getString(str1, str2, count). Функція повинна додати str2 до рядочка str1 стільки разів 
// скільки вказали у параметрі count.

// function getString(str1, str2, count) {
//     for (let i = 0; i < count; i++){
//         str1 += str2;
//     }
//     return str1;
// }

// console.log(getString("Hello", " World", 3));