//* Прості задачі *//


// Напиши функцію, яка приймає масив та виводить кожен елемент масиву у консоль.

// function foo(arr) {
//     for (let elem of arr) {
//         console.log(elem);  
//     }
// }

// foo([1, 2, 3, 4, 5])


//!==========================================================================================

// Напиши функцію, яка приймає масив та виводить кожен парний елемент масиву у консоль.

// function printArrayElements(arr) {
//     for (let elem of arr) {
//         if (elem % 2 === 0) {
//             console.log(elem); 
//         }
//     }
// }

// printArrayElements([1, 2, 3, 4, 5])


// Ця функція перевіряє довжину кожного рядка, і якщо вона парна, виводить цей рядок у консоль.

// function printEvenLengthStrings(arr) {
//     for (let elem of arr) {
//         if (elem.length % 2 === 0) {
//             console.log(elem);
//         }
//     }
// };

// printEvenLengthStrings(['apple', 'banana', 'orange', 'pear']);


// функція, яка перевіряє, чи кожен індекс елемента масиву ділиться на 2, і виводить сам елемент


// function printElementsWithEvenIndexes(arr) {
//     for (let i = 0; i < arr.length; i++) {
//         if (i % 2 === 0) {
//             console.log(arr[i]);
//         }
//     }
// }

// printElementsWithEvenIndexes(['apple', 'banana', 'orange', 'pear', 'grape']);


//!==========================================================================================

// Напиши функцію, яка приймає масив чисел та виводить лише парні числа у консоль.

// function foo(arr) {
//     for (let elem of arr) {
//         if (elem % 2 === 0) {
//             console.log(elem); 
//         }
//     }
// }

// foo([1, 2, 3, 4, 5, 6, 7, 8, 9]);

//!==========================================================================================

// Напиши функцію, яка приймає два параметри (arr, max). 
// Де arr - це масив чисел. Потрібно вивести лише ті елементи масиву які більші за max.
    
    // function foo(arr, max) {
    //     for (let num of arr) {
    //         if (num > max) {
    //             console.log(num);
    //         }
    //     }
    // }

    // foo([1, 2, 3, 24, 55, 6, 17, 8, 9], 10 );

//!==========================================================================================

// Напиши функцію яка приймає масив та повертає суму всіх чисел у масиві.

// function sumArray(arr) {
//     let totalSum = 0;
//     for (let num of arr) {
//         totalSum += num; 
//     }
//     return totalSum;
// }

// console.log(sumArray([1, 2, 3, 24, 55, 6, 17, 8, 9]));

//!==========================================================================================

// Напиши функцію яка приймає масив та елемент для пошуку. 
// Фукнція повинна порахувати скільки разів шуканий елемент 
// зустрічається у масиві.

// function isPresent(arr, element) { 
//     let count = 0;
//     for (let item of arr) {
//         if (item === element) {
//             count++;
//         }
//     };
//     return count
// }
// console.log(isPresent(['apple', 'banana', 'orange', 'pear', 'grape', 'banana'], 'banana')); //2
// console.log(isPresent([1, 2, 3, 2, 4, 2, 5], 2)); //3
 

//!==========================================================================================
// Напиши функцію яка приймає масив чисел. 
// Функція повинна видалити усі негативні(відємні числа) з масиву 
// та повернути новий масив.

// function removeNegativeNumbers(arr) {
//     for (let num of arr) {
//         if (num > 0) {
//             console.log(num);
//         }
//     }
// };

// console.log(removeNegativeNumbers([1, -2, 3, -4, 5, 0]));  // Виведе [1, 3, 5, 0]
// console.log(removeNegativeNumbers([-10, -20, 30, 40]));    // Виведе [30, 40]

//!==========================================================================================

// Напиши функцію яка приймає масив рядочків. 
// Потрібно змінити кожен елемент масиву наступним чином - 
// якщо довжина рядочку менша за 6 до привести рядок до нижнього регістру, 
// в іншому випадку привести до верхнього регістру.

// function transformStrings(arr) {
    
//     let result = [];
//     for (let item of arr) {
//         item.length < 6 ? result.push(item.toLowerCase()) : result.push(item.toUpperCase())
//     }
//     return result
//     }


// console.log(transformStrings(['apple', 'mango', 'banana', 'pear', 'grape'])); 
// Виведе ['apple', 'mango', 'BANANA', 'pear', 'grape']
// console.log(transformStrings(['hello', 'WORLD', 'JS', 'coding'])); 
// Виведе ['hello', 'WORLD', 'js', 'CODING']

//!==========================================================================================

// Напиши функцію, яка приймає масив чисел і повертає новий масив, 
// що містить лише непарні числа.

// function removeOddNumbers(arr) {
//     let newArr =[]
//     for (let number of arr) {
//         if (number % 2 === 0) {
//             newArr.push(number);
//         };
//     };
//     return newArr;
// }

// console.log(removeOddNumbers([1, 2, 3, 2, 4, 2, 5], 2)); 

//!==========================================================================================

// Напиши функцію, яка приймає масив чисел і повертає новий масив, 
// де кожне число помножене на індекс, за яким воно знаходиться в масиві.

// function multiplyByIndex (arr) {
//     let newArr = [];
//     for (let i = 0; i < arr.length; i++) {
//         newArr.push(arr[i] * i);
//     };
//     return newArr;
// };

// console.log(multiplyByIndex ([1, 2, 3, 2, 4, 2, 5]))

//!==========================================================================================

// Напиши функцію, яка приймає масив чисел і повертає новий масив, 
// що містить лише числа, які діляться на 3.

// function divideByThree(arr) {
//     let newArr = [];
//     for (let element of arr) {
//         if (element % 3 === 0) {
//             newArr.push(element);
//         };
//     };
//     return newArr;
// };

// console.log(divideByThree([1, 2, 3, 2, 4, 2, 5, 15, 30000]));



//!==========================================================================================


//* Середні задачі *//


// Напиши функцію яка приймає два масиви (arr1, arr2), та повертає новий масив, 
// де будуть лише ті елементи які зустрічаються і в arr1 і arr2.


// function foo(arr1, arr2) {
//     let result = [];
//     for (item of arr1) {
//         if (arr2.includes(item)) {
//             result.push(item)
//         };
//     };
//     return result;
// };

// console.log(foo([1, 2, 3, 4, 5, 6], [9, 2, 8, 4, 7, 6])); 
// console.log(foo(['apple', 'orange', 'pear', 'grape', 'banana'], ['apple', 'grape', 'banana']));

//!==========================================================================================

// Напиши функцію яка приймає два масиви (arr1, arr2), та повертає новий масив,
// де будуть лише елементи масиву arr1 яких не має у масиві arr2.

function foo (arr1, arr2) {
    let newArray = [];
    for()
}



//!==========================================================================================

// Напиши функцію яка приймає масив та знаходить мінімальний елемент.

//!==========================================================================================

// Напиши функцію яка приймає масив та знаходить максимальний елемент.

//!==========================================================================================

// Напиши функцію яка приймає масив та повертає масив лише з тих елементів 
// які більші за середнє значення всіх елементів масиву.

//!==========================================================================================

// Напиши функцію яка приймає масив та повертає масив лише з тих елементів 
// які більші за власний індекс.

//!==========================================================================================

// Напишіть функці яка приймає масив чисел. Функція повинна занйти мінімальний 
// елемент та видалити його з масиву.

//!==========================================================================================

// Напиши функцію яка приймає два параметри start та end. 
// Функія повина повернути масив де будуть числа з діапазону але лише ті у яких не має цифри 5. 
// К прикладу числа(51, 25, 15, 256) не підходять бо містять символ "5" у собі.

//!==========================================================================================



//* Складні *//


// Напиши функцію, яка приймає массив чисел і повертає новий масив,
// де всі парні числа переміщені в початок,а всі непарні - в кінець.

//!==========================================================================================

// Напиши функцію, яка приймає массив чисел і повертає новий массив, 
// де кожен елемент є сумою усіх попередніх елементів.

//!==========================================================================================

// Напиши функцію, яка приймає массив чисел і повертає новий массив, 
// що містить лише унікальні числа.

//!==========================================================================================

// Напиши функцію, яка приймає два масиви і повертає об'єднаний массив без дублювання елементів.

//!==========================================================================================

// Напиши функцію, яка приймає массив чисел і повертає новий массив, 
// де кожен елемент є середньоарифметичним всіх сусідніх елементів.

//!==========================================================================================

// Напиши функцію, яка приймає массив чисел і повертає новий массив, 
// де елементи відсортовані в порядку збільшення або зменшення.

//!==========================================================================================

// Напиши функцію, яка приймає массив рядочків та сортує їх за довжиною елементів.